// За да взема данни от НЕТА - AJAX
// 1. Инициализиране на обект за работа с HTTP заявки
// -- отваряме си браузъра
const httpRequest = new XMLHttpRequest();

// 2. Инициализираме заявка към конкретен WEB ресурс
// 2.1 --> Какъв ще бъде метода чрез който ще пращаме данните
// GET      -- взима данни      
// POST     -- изпраща данни    (създаване на нещо ново)
// PUT      -- изпраща данни    (актуализира същствуващо нещо)
// DELETE   -- изпраща данни    (изтрие съществуващо нещо)
httpRequest.open('POST', 'https://jsonplaceholder.typicode.com/posts');

// 3. Изпращане на заявка
// 3.1 Ако метода е GET пращаме заявка за получаване
// 3.2 Ако метода е POST пращаме заявка с допълнителни данни към нея.
httpRequest.send(JSON.stringify({
    "userId": 1,
    "title" : "New Post",
    "body"  : "New Post Body"
}));

// 4. Изчакваме зареждането на данни в анонимна функция
// !!!! Връщани данни са САМО САМО И ЕДИНСТВЕНО ТЕКСТ
httpRequest.onload = () => {
    console.log("Process compleated");
};